#include "MenuLCD.h"


void InitMenu()
{
    m[0].down = &m[1];
	m[0].right = &m1[0];
	// Настройка М2
	m[1].up = &m[0];
	m[1].right = &m2[0];
	m[1].down = &m[2];
	// Настройка М3
	m[2].up = &m[1];
	m[2].right = &m3[0];
	m[2].down = &m[3];
	// Настройка М4
	m[3].up = &m[2];
	m[3].right = &m4[0];
	m[3].down = &m[4];
	// Настройка М5
	m[4].up = &m[3];
	m[4].right = &m5[0];
	m[4].down = &m[5];
	// Настройка М6
	m[5].up = &m[4];
	m[5].right = &m6[0];

	// Второй уровень меню M1
	// Настройка М11
	m1[0].left = &m[0];
	m1[0].down = &m1[1];
	// Настройка М12
	m1[1].up = &m1[0];
	m1[1].down = &m1[2];
	m1[1].left = &m[0];
	// Настройка М13
	m1[2].up = &m1[1];
	m1[2].left = &m[0];

	// Второй уровень меню M2
	// Настройка М21
	m2[0].left = &m[0];
	m2[0].down = &m2[1];
	// Настройка М22
	m2[1].up = &m2[0];
	m2[1].down = &m2[2];
	m2[1].left = &m[0];
	// Настройка М23
	m2[2].up = &m2[1];
	m2[2].left = &m[0];

	// Второй уровень меню M3
	// Настройка М31
	m3[0].left = &m[0];
	m3[0].down = &m3[1];
	// Настройка М32
	m3[1].up = &m3[0];
	m3[1].down = &m3[2];
	m3[1].left = &m[0];
	// Настройка М33
	m3[2].up = &m3[1];
	m3[2].left = &m[0];

	// Второй уровень меню M4
	// Настройка М41
	m4[0].left = &m[0];
	m4[0].down = &m4[1];
	// Настройка М42
	m4[1].up = &m4[0];
	m4[1].down = &m4[2];
	m4[1].left = &m[0];
	// Настройка М43
	m4[2].up = &m4[1];
	m4[2].left = &m[0];

	// Второй уровень меню M5
	// Настройка М51
	m5[0].left = &m[0];
	m5[0].down = &m5[1];
	// Настройка М52
	m5[1].up = &m5[0];
	m5[1].down = &m5[2];
	m5[1].left = &m[0];
	// Настройка М53
	m5[2].up = &m5[1];
	m5[2].left = &m[0];

	// Второй уровень меню M6
	// Настройка М61
	m6[0].left = &m[0];
	m6[0].down = &m6[1];
	// Настройка М62
	m6[1].up = &m6[0];
	m6[1].down = &m6[2];
	m6[1].left = &m[0];
	// Настройка М63
	m6[2].up = &m6[1];
	m6[2].left = &m[0];
}
